// [1] 데이터와 타입 
3;          // - 숫자타입의 데이터 3
3.14;       // - 숫자타입의 데이터 3.14;
123456;     // - 숫자타입의 데이터 123456
'안녕 JS1'; // - 문자열 타입의 데이터 
"안녕 JS2"; // - 문자열 타입의 데이터 
`안녕 JS3`; // - 문자열 타입의 데이터 
true;       // - 논리타입 
false;      // - 논리타입 
            // JS 는 실수와 정수를 number 타입으로 관리한다.     
// [2] 데이터 출력하기 
console.log(3);
console.log(3.14);
console.log(123456);
console.log('안녕 JS1');
console.log("안녕 JS2");
console.log(`안녕 JS3`);
console.log(true);
console.log(false);

// 실습] 출력
console.log(`\\\t /\\ \n )  ( \') \n(  /  )\n \\(__)|`);
// 확인 주의할 점 : 크롬에서는 백슬래시가 원화 기호로 표시된다. 엣지 브라우저 

// [3] 브라우저에서 입력받기 
prompt();
prompt(`[안내]아무거나 입력하세요.`);
